package day1;

// 주석
// - 프로그램 코드안에 설명을 작성할 때 사용합니다
// - 프로그램 실행에 영향을 주지 않습니다

// 슬래쉬 두번 : 한줄 주석

/* 슬래쉬 별 : 여러주 주석 시작

 이안에 모든 내용이 주석 처리 됩니다
 
 별 슬래쉬 : 여러줄 주석 종료*/

/*
 * 사용자 정의 명칭 : class, 변수명...
 * - 영문 대소문자, 숫자, _(밑줄), $ 만 사용 가능합니다
 * - 이름의 첫글자로 숫자를 사용할 수 없습니다
 * - 이름 중간에 공백을 사용할 수 없습니다
 * - 영문 대소문자를 구별합니다( Name, name 다른 이름 )
 * - 예약어는 사용할 수 없습니다( Java 에서 사용중인 이름 )
 * 
 * class 명 작성 규칙
 * - 이름의 첫글자는 영문 대문자로 시작합니다
 * - 합성어의 두번째 단어의 첫글자는 대문자로 시작합니다
 * 
 */

public class Ex01Basic {
	
	public static void main(String[] args) {
		
		
		
	}

}
















